Repository: mohamed-zakariya/Human_Aid
Catalog: frontend/mobileapp/lib/l10n/intl_*.arb
Languages: ar

# bottomNavProfile
source: Profile
ar: الملف الشخصي

# bottomNavMenu
source: Menu
ar: القائمة

source: Levels
ar: المستويات

source: Level
ar: المستوى

# selectLevelToStart
source: Select a level to start playing
ar: اختر مستوى للبدء باللعب

source: Games
ar: ألعاب

source: Error loading levels
ar: خطأ في تحميل المستويات

source: Try Again
ar: حاول مرة أخرى

# noLevelsAvailable
source: No levels available for this exercise
ar: لا توجد مستويات متاحة لهذا التمرين

# selectGameToPlay
source: Select a game to start playing
ar: اختر لعبة للبدء

# noGamesAvailable
source: No games available for this level
ar: لا توجد ألعاب متاحة لهذا المستوى

# playGame
source: Play Now
ar: العب الآن

# monthsOrderTitle
source: Order the Months
ar: ترتيب الشهور

# monthsOrderHeader
source: Order {count} months of the year
ar: رتب {count} شهور السنة

# monthsOrderHelpDrag
source: Drag the months from below and place them in the correct order
ar: اسحب الشهور من الأسفل وضعها في الترتيب الصحيح

# monthsOrderHelpOrder
source: Order the months from January to the last month in the level
ar: رتب الشهور من يناير إلى آخر شهر في المستوى

# monthsOrderHelpListen
source: Tap the month to hear its name
ar: اضغط على الشهر لسماع اسمه

# monthsOrderHelpTranslate
source: Tap the translate button to switch between Arabic and Levantine names
ar: اضغط على زر الترجمة لتبديل بين الأسماء العربية والشامية

# translateMonthsTooltip
source: Switch month names
ar: تبديل أسماء الشهور

# monthsOrderSuccess
source: Great job! You've ordered the months correctly.
ar: أحسنت! لقد رتبت الشهور بشكل صحيح.

source: Play Again
ar: العب مرة أخرى

source: all
ar: جميع

# monthsOrderLevelInstruction
source: Level {level}: Order {count} months {direction}
ar: المستوى {level}: رتب {count} أشهر {direction}

# orderAscending
source: from first to last
ar: من البداية إلى النهاية

# orderDescending
source: from last to first
ar: من النهاية إلى البداية

# levelSuccess
source: 🎉 Amazing! You've completed level {level}!
ar: 🎉 رائع! لقد أكملت المستوى {level}!

# levelFailure
source: Don't worry! Practice makes perfect. Try this level again!
ar: لا تقلق! التمرين يؤدي إلى الإتقان. حاول هذا المستوى مرة أخرى!

# levelRetry
source: Keep going! You're getting better with each try!
ar: واصل! أنت تتحسن مع كل محاولة!

# finalLevelSuccess
source: 🌟 Incredible! You've mastered all month orders!
ar: 🌟 مذهل! لقد أتقنت ترتيب جميع الأشهر!

# gameCompleted
source: Completed!
ar: تم الإكمال!

# orderMonthsCorrectly
source: Order the months correctly.
ar: رتب الأشهر بشكل صحيح.

# learnerNavBarHome
source: Home
ar: الرئيسية

# learnerNavBarCourses
source: Courses
ar: الدورات

# learnerNavBarProfile
source: Profile
ar: الملف الشخصي

# learnerNavBarMenu
source: Menu
ar: القائمة

# logoutSubtitle
source: Sign out securely
ar: تسجيل الخروج بأمان

# cancelButton
source: cancel
ar: إلغاء

# logoutConfirmationTitle
source: Logout Confirmation
ar: تأكيد تسجيل الخروج

# logoutConfirmationMessage
source: Are you sure you want to logout? You will need to sign in again.
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟ ستحتاج إلى تسجيل الدخول مرة أخرى.

# logoutButton
source: Logout
ar: تسجيل الخروج

# chooseLanguageTitle
source: Choose Language
ar: اختر اللغة

# chooseLanguageSubtitle
source: Select your preferred language
ar: حدد لغتك المفضلة

# englishLanguage
source: English
ar: الإنجليزية

# defaultUserName
source: User
ar: مستخدم

# defaultUsername
source: username
ar: اسم المستخدم

# appTitle
source: Object Detection Exercise
ar: تمرين كشف الأشياء

# bringObject
source: Bring a {object}
ar: أحضر {object}

source: Object Detection Exercise
ar: تمرين كشف الأشياء

# objectDetectionHint
source: Point your camera at the requested object to complete the exercise
ar: وجه الكاميرا نحو الشيء المطلوب لإكمال التمرين

# hint
source: Point your camera at the requested object to complete the exercise
ar: وجه الكاميرا نحو الشيء المطلوب لإكمال التمرين

source: spoon
ar: ملعقة

source: cup
ar: كوب

source: pen
ar: قلم

source: fork
ar: شوكة

source: plate
ar: طبق

# objectDetected
source: Great! Object detected!
ar: رائع! تم اكتشاف الشيء!

# objectNotFound
source: Object not detected. Keep trying!
ar: لم يتم اكتشاف الشيء. استمر في المحاولة!

source: Next Exercise
ar: التمرين التالي

# score
source: Score: {score}
ar: النتيجة: {score}

source: Loading words...
ar: جاري تحميل الكلمات...

# allWordsCompleted
source: Great job! You've completed all words!
ar: عمل رائع! لقد أكملت جميع الكلمات!

source: Congratulations!
ar: مبروك!

# completedAllWords
source: You have successfully completed all words in this exercise!
ar: لقد أكملت بنجاح جميع الكلمات في هذا التمرين!

source: Finish
ar: إنهاء

source: Start Over
ar: ابدأ من جديد

source: View Results
ar: عرض النتائج

source: Locked
ar: مقفل

# gameLockedMessage
source: This game is locked. Complete previous levels to unlock it.
ar: هذه اللعبة مقفلة. أكمل المستويات السابقة لإلغاء قفلها.

source: Level One - Live Camera
ar: المستوى الأول - كاميرا مباشرة

source: New Word
ar: كلمة جديدة

source: Target Word
ar: الكلمة المطلوبة

source: Analyzing...
ar: جاري التحليل...

source: Preparing Camera...
ar: جاري تحضير الكاميرا...

source: Result
ar: النتيجة

# correct_answer
source: Correct Answer! Well Done!
ar: إجابة صحيحة! أحسنت!

source: Try Again
ar: حاول مرة أخرى

# point_camera_instruction
source: Point the camera towards the target object within the red frame
ar: وجه الكاميرا نحو الكائن المطلوب داخل الإطار الأحمر

source: Processing
ar: جاري المعالجة

source: Ready to Capture
ar: جاهز للتصوير

source: ❌ Error reading result
ar: ❌ خطأ في قراءة النتيجة

# congratsAllWordsCompleted
source: Well done! You've completed all the words.
ar: أحسنت! لقد أكملت جميع الكلمات.

# learnerIdRequired
source: Learner ID is required
ar: معرف المتعلم مطلوب

# profileDataLoadError
source: Some profile data could not be loaded
ar: لا يمكن تحميل بعض بيانات الملف الشخصي

source: Profile Information
ar: معلومات الملف الشخصي

source: Not provided
ar: غير متوفر

source: Learning Journey
ar: رحلة التعلم

source: Total Time
ar: الوقت الإجمالي

source: Achievement
ar: الإنجاز

source: Personal Details
ar: التفاصيل الشخصية

source: Birth Date
ar: تاريخ الميلاد

source: Parent Name
ar: اسم الوالد

source: Loading Profile...
ar: جاري تحميل الملف الشخصي...

source: Failed to load profile
ar: فشل في تحميل الملف الشخصي

source: Profile not found
ar: الملف الشخصي غير موجود

# yearsOld
source: {age} years old
ar: {age} سنة

source: Unknown
ar: غير معروف

# minutesFormat
source: {minutes}m
ar: {minutes} د

# hoursMinutesFormat
source: {hours}h {minutes}m
ar: {hours} س {minutes} د

source: Explorer
ar: مستكشف

source: Rising Star
ar: نجم صاعد

source: Bright Mind
ar: عقل مشرق

source: Knowledge Seeker
ar: باحث عن المعرفة

source: Wisdom Builder
ar: بناء الحكمة

source: Master Learner
ar: متعلم متمكن

source: Learning Champion
ar: بطل التعلم
