Repository: mohamed-zakariya/Human_Aid
Catalog: frontend/mobileapp/lib/l10n/intl_*.arb
Languages: ar

# title
source: Create Account
ar: إِنْشَاءُ حِسَابٍٍ

# signuptitlename
source: Name
ar: الاسم

# signupinputfieldname
source: ex:MohamedZakaria
ar: مثال:ابراهيم مصطفي

# signuptitleusername
source: username
ar: اسم المستخدم

# signupinputfieldusername
source: ex:ibrahimzekas123
ar: مثال:ibrahimzekas123

# signuptitleemail
source: email
ar: البريد الالكتروني

# signupinputfieldemail
source: ex:ibrahimzekas@gmail.com
ar: مثال:ibrahimzekas@gmail.com

# signuptitlephonenumber
source: phone number
ar: رقم الهاتف

# signuptitlenationality
source: Nationality
ar: الجنسية

# signupinputfieldnationality
source: ex:Egyptian
ar: مثال:مصري

# signuptitlepassword
source: password
ar: كلمة المرور

# signupinputfieldpassword
source: ex:MyP@ssw0rd123
ar: مثال:MyP@ssw0rd123

# signuptitleconfirmpassword
source: confirm password
ar: تأكيد كلمة المرور

# signup_password_mismatch
source: Don't Match
ar: ليس متماشث

# signuptitlebirthdate
source: Birthdate
ar: تاريخ الميلاد

# signupinputfieldbirthdate
source: ex:15/7/2002
ar: مثال:15/7/2002

# phonenumbersearch
source: search
ar: ابحث

# genderSelect
source: Select Gender
ar: اختار النوع

# genderSelected
source: Selected:
ar: :اختار

# genderMale
source: Male
ar: ذكر

# genderFemale
source: Female
ar: انثي

# continuesignuptitle
source: Child Registration
ar: تَسْجِيلُ بَيَانَاتِ الطِّفْلِ

# createaccountbutton
source: Create Account
ar: إنشاء الحساب

# signupbutton
source: Continue
ar: استمرار

# parentNavBarHome
source: Home
ar: القائمة

# parentNavBarChangeLanguage
source: Choose Language
ar: اختر اللغة

# parentNavBarSettings
source: Settings
ar: الاعدادات

# parentNavBarLogout
source: Logout
ar: تسجيل الخروج

# usernameRequired
source: Username must be entered
ar: يجب إدخال اسم المستخدم

# usernameShort
source: Username must be at least 3 characters
ar: يجب أن يكون اسم المستخدم على الأقل 3 أحرف

# usernameExist
source: This username is already taken
ar: اسم المستخدم مأخوذ بالفعل

# emailRequired
source: Email must be entered
ar: يجب إدخال البريد الإلكتروني

# emailInvalid
source: Enter a valid email address
ar: يرجى إدخال بريد إلكتروني صحيح

# emailExist
source: This email is already registered
ar: هذا البريد الإلكتروني مسجّل بالفعل

# passwordRequired
source: Password must be entered
ar: يجب إدخال كلمة المرور

# passwordShort
source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

# confirmPasswordRequired
source: Confirm password is required
ar: يجب تأكيد كلمة المرور

# passwordMismatch
source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# adultSignupTitle
source: Create Account
ar: إِنْشَاءُ حِسَابٍ كمتعلم

# dashboard_title
source: 's Dashboard
ar: لوحة معلومات

# welcome_message
source: Welcome Back,
ar: مرحبًا بعودتك،

# explore_message
source: Let's explore some insights today
ar: لنستكشف بعض الأفكار اليوم

source: Categories
ar: الفئات

source: Tips
ar: نصائح

source: Learner Members
ar: أعضاء المتعلمين

source: Add Word
ar: إضافة كلمة

# learner_progress
source: Learners Progress
ar: تقدّم المتعلّمين

# no_progress_data
source: No data available.
ar: لا توجد بيانات متاحة

# view_details
source: view Detials
ar: عرض التفاصيل

source: Add New Learner
ar: إضافة متعلم جديد

source: Cancel
ar: إلغاء

source: Add
ar: إضافة

# clickToAddLearners
source: Click the + button to add learners.
ar: اضغط على زر + لإضافة المتعلمين.

source: Show more
ar: عرض المزيد

# dashboardTitle
source: {name} Dashboard
ar: لوحة تحكم {name}

# exercise2Title
source: Exercise 2
ar: التدريب التاني

# fishGameTitle
source: Fish Game with Letters
ar: لعبة الأسماك بالحروف

# roundLabel
source: Round {current} of {total}
ar: الجولة {current} من {total}

source: Listen to Letter
ar: استمع إلى الحرف

# howToPlayTitle
source: How to Play
ar: كيفية اللعب

# howToPlayDescription
source: Listen to the letter and find the matching fish. Tap on the correct fish. Earn a point for each correct answer!
ar: استمع إلى الحرف وابحث عن السمكة المطابقة. اضغط على السمكة الصحيحة. تحصل على نقطة لكل إجابة صحيحة!

# okButton
source: OK
ar: حسنًا

# correctAnswer
source: 🎉 Correct!
ar: 🎉 صحيح!

# wrongAnswer
source: ❌ Wrong! The correct letter is: {letter}
ar: ❌ خطأ! الحرف الصحيح هو: {letter}

# greatJob
source: 🎉 Great job! Your score: {score} out of {total}
ar: 🎉 أحسنت! درجتك: {score} من {total}

# tryAgain2
source: 😊 Good try! Your score: {score} out of {total}
ar: 😊 لا بأس! درجتك: {score} من {total}

source: Listen
ar: استمع

# traceThisLetter
source: 📝 Trace this letter: {letter}
ar: 📝 تتبع هذا الحرف: {letter}

source: ✅ Finish Tracing
ar: ✅ إنهاء التتبع

# completedAllLetters
source: 🎉 You've completed all letters!
ar: 🎉 لقد أنهيت جميع الحروف!

# encouragementMessage
source: 👏 Well done! You traced all 28 Arabic letters!
ar: 👏 أحسنت! لقد تتبعت جميع الحروف العربية الـ28!

source: 📚 How to Trace
ar: 📚 كيفية التتبع

# instructions
source: 1. Trace the letter with your finger. 2. Try to stay on the shape. 3. Press Done when finished.
ar: ١. تتبع الحرف بإصبعك. ٢. حاول البقاء على شكل الحرف. ٣. اضغط تم عند الانتهاء.

source: Got it!
ar: فهمت!

source: ✅ Done
ar: ✅ تم

source: 🧹 Clear
ar: 🧹 مسح

# traceTitle
source: ✍️ Trace the letter
ar: ✍️ تتبع الحرف

# greatJob2
source: 🎉 Great job!
ar: 🎉 عمل رائع!

source: Restart
ar: ابدأ من جديد

# tryAgain3
source: ❌ Try Again
ar: ❌ حاول مرة أخرى

source: Retry
ar: إعادة المحاولة

source: Well done! ✅
ar: !أحسنت ✅

# youTracedCorrectly
source: You traced the letter correctly!
ar: لقد قمت بتتبع الحرف بشكل صحيح.

source: Next
ar: التالي

source: Spelling Game
ar: لعبة التهجئة

source: Help
ar: مساعدة

# instructionsTitle
source: How to Play
ar: كيفية اللعب

# instruction1
source: Drag the letters into the correct order.
ar: اسحب الحروف بالترتيب الصحيح.

# instruction2
source: If the answer is correct, you'll get a new word.
ar: إذا كانت الإجابة صحيحة، ستحصل على كلمة جديدة.

# instruction3
source: Try to complete all words and get a high score!
ar: حاول إكمال جميع الكلمات للحصول على أعلى نتيجة!

# wordsGame3Title
source: Months Game
ar: لعبة الشهور

source: Verify
ar: تحقق

# drawLetter
source: Draw the letter "{letter}"
ar: ارسم الحرف "{letter}"

# drawInstruction
source: Touch and draw anywhere on the canvas
ar: المس وارسم في أي مكان على اللوحة

# strokeCount
source: Strokes: {count}
ar: عدد الخطوط: {count}

# pointCount
source: Points: {count}
ar: عدد النقاط: {count}

# gameOverTitle
source: 🎮 Game Over
ar: 🎮 انتهت اللعبة

# greatJobMotivation
source: 🎉 Great job! You're doing amazing!
ar: 🎉 عمل رائع! أنت مذهل!

# tryAgainMotivation
source: 💪 Keep going! You can do it!
ar: 💪 استمر! يمكنك فعلها!

# correctFeedback
source: Well done! 🎉
ar: أحسنت! 🎉

# wrongFeedback
source: Try again
ar: حاول مرة أخرى

# roundLabel2
source: Round
ar: الجولة

# timeLabel
source: Time
ar: الوقت

source: Exit
ar: إنهاء

# gameFinished
source: Game Over!
ar: انتهت اللعبة!

# info
source: Information about Training
ar: معلومات عن التمرين

# instructionTimer
source: Each question has 5 seconds to answer.
ar: سيكون لكل سؤال مؤقت 5 ثوانٍ للإجابة.

# instructionLookCarefully
source: Look carefully at the direction shape and choose the correct sentence.
ar: انظر إلى شكل الاتجاه بعناية واختر الجملة الصحيحة.

# instructionAnswerShown
source: After each question, the correct answer will be shown.
ar: بعد كل سؤال، سيتم عرض الإجابة الصحيحة.

# ttsInstructions
source: Each question has 5 seconds to answer. Look carefully at the direction shape and choose the correct sentence. After each question, the correct answer will be shown.
ar: سيكون لكل سؤال مؤقت 5 ثوانٍ للإجابة. انظر إلى شكل الاتجاه بعناية واختر الجملة الصحيحة. بعد كل سؤال، سيتم عرض الإجابة الصحيحة.

source: Start Exercise
ar: ابدأ التمرين

source: Directions
ar: الاتجاهات

# tapArrowToHear
source: Tap the arrow to hear the direction
ar: اضغط على السهم لسماع الاتجاه

# directionExerciseTitle
source: Direction Exercise
ar: تمرين الاتجاهات

# seconds
source: {count} seconds
ar: {count} ثانية

# questionProgress
source: Question {current} / {total}
ar: السؤال {current} / {total}

# whatIsDirection
source: What is the direction?
ar: ما هو الاتجاه؟

# listenAgain
source: Listen again ({remaining} attempts left)
ar: اسمع مرة أخرى ({remaining} محاولات متبقية)

source: Correct! ✅
ar: صحيح! ✅

# incorrect
source: Wrong! ❌
ar: خطأ! ❌

# correctAnswerIs
source: Correct answer: {answer}
ar: الإجابة الصحيحة: {answer}

# tryAgainEncouragement
source: Try again! 💪
ar: حاول مرة أخرى! 💪

source: Excellent! 🎉
ar: ممتاز! 🎉

source: Bravo! 👏
ar: براڤو! 👏

source: Amazing! 😎
ar: مذهل! 😎

# gameName
source: Direction Game
ar: لعبة الاتجاهات

# exerciseInfoTitle
source: Exercise Information
ar: معلومات عن التمرين

# timerInfo
source: Each question has 8 seconds to answer.
ar: سيكون لكل سؤال مؤقت 8 ثوانٍ للإجابة.

# dragInfo
source: Drag the image to the correct direction.
ar: اسحب الصورة وضعها في الاتجاه الصحيح.

# correctDirectionInfo
source: After each question, the correct direction will be shown.
ar: بعد كل سؤال، سيتم عرض الاتجاه الصحيح.

# directionsTitle
source: Directions
ar: الاتجاهات

# tapToHearDirection
source: Tap the arrow to hear the direction
ar: اضغط على السهم لسماع الاتجاه

# speakDirectionTemplate
source: The direction is {direction}
ar: الاتجاه في {direction}

# instructionSpeech
source: Each question has 8 seconds to answer. Drag the image to the correct direction. After each question, the correct direction will be shown.
ar: سيكون لكل سؤال مؤقت 8 ثوانٍ للإجابة. اسحب الصورة وضعها في الاتجاه الصحيح. بعد كل سؤال، سيتم عرض الاتجاه الصحيح.

# returnBack
source: Return
ar: العودة

source: Don't worry, try again
ar: لا تقلق، حاول مرة أخرى

# tryingHardGreat
source: You're trying hard, that's great
ar: أنت تحاول بجد، هذا رائع

# tryingIsFirstStep
source: Trying is the first step
ar: المحاولة هي الخطوة الأولى

# everyTryMakesStronger
source: Every try makes you stronger
ar: كل محاولة تجعلك أقوى

# dontGiveUpLearning
source: Don't give up, learning takes time
ar: لا تستسلم، التعلم يحتاج وقت

source: Learning needs patience
ar: التعلم يحتاج إلى صبر

# keepTryingProgressing
source: Keep trying, you're progressing
ar: استمر في المحاولة، أنت تتقدم

source: Very great
ar: رائع جداً

source: Excellent work
ar: عمل ممتاز

# verySmart
source: You're very smart
ar: أنت ذكي جداً

source: Keep progressing
ar: استمر في التقدم

source: Up
ar: أعلى

source: Down
ar: أسفل

source: Right
ar: يمين

source: Left
ar: يسار

source: Up Right
ar: أعلى يمين

source: Down Right
ar: أسفل يمين

source: Up Left
ar: أعلى يسار

source: Down Left
ar: أسفل يسار

source: Cat
ar: قطة

source: Apple
ar: تفاحة

source: Car
ar: سيارة

source: Book
ar: كتاب

source: Ball
ar: كرة

# dragImageToCorrectDirection
source: Drag the image to the correct direction
ar: اسحب الصورة إلى الاتجاه الصحيح

# correctDirectionIs
source: The correct direction is {direction}
ar: الاتجاه الصحيح هو {direction}

source: Exercise Finished
ar: انتهى التمرين

source: Exercise Completed
ar: تم إنجاز التمرين

# finalScore
source: Final Score: {score} out of {total}
ar: النتيجة النهائية: {score} من {total}

# placeImageInDirection
source: Place {item} in {direction} direction
ar: ضع {item} في اتجاه {direction}

# helpful_tips
source: Helpful tips for learning
ar: نصائح مفيدة للتعلم

# manage_learners
source: Manage your learners
ar: إدارة المتعلمين

# add_vocabulary
source: Add new vocabulary
ar: إضافة مفردات جديدة

# track_progress
source: Track learning progress
ar: تتبع التقدم في التعلم

source: Explore
ar: استكشاف

# search_hint
source: Search for activities...
ar: ابحث عن الأنشطة...

source: Recent Activity
ar: النشاطات الأخيرة

source: Great Progress!
ar: تقدم رائع!

# learners_completed_activities
source: Your learners completed {count} activities today
ar: أكمل متعلموك {count} نشاطًا اليوم

source: Today
ar: اليوم

# tips_title
source: Tips
ar: نصائح

source: Track Learning Progress
ar: تتبع تقدم التعلم

# monitor_daily_activities
source: Monitor daily learning activities
ar: راقب الأنشطة التعليمية اليومية

source: Progress Summary
ar: ملخص التقدم

# no_learning_activities
source: No learning activities recorded for this day
ar: لم يتم تسجيل أي نشاط تعليمي لهذا اليوم

# stat_total
source: Total
ar: الإجمالي

# stat_correct
source: Correct
ar: صحيح

# stat_incorrect
source: Incorrect
ar: خاطئ

source: Exercise Breakdown
ar: تفصيل التمارين

# label_letters
source: Letters
ar: الحروف

# label_words
source: Words
ar: الكلمات

# label_sentences
source: Sentences
ar: الجمل

# label_games
source: Games
ar: الألعاب

source: Game Summary
ar: ملخص الألعاب

source: game sessions
ar: جلسات الألعاب

source: total attempts
ar: إجمالي المحاولات

source: Quest Complete
ar: المهمة مكتملة

source: Quest Pending
ar: المهمة قيد الانتظار

source: Award Won
ar: تم الفوز بالجائزة

source: No Award
ar: لا توجد جائزة

source: Learner Details
ar: تفاصيل المتعلم

source: No learner data available.
ar: لا توجد بيانات متاحة للمتعلم.

# parentNavBarLearnerMembers
source: Learner Members
ar: أعضاء المتعلمين

# parentNavBarLearnersProgress
source: Learners Progress
ar: تقدم المتعلمين

# parentNavBarChooseLanguage
source: Choose Language
ar: اختر اللغة

# parentNavBarEnglish
source: English
ar: الإنجليزية

# parentNavBarArabic
source: Arabic
ar: العربية

# parentNavBarLogoutConfirmation
source: Logout Confirmation
ar: تأكيد تسجيل الخروج

# parentNavBarLogoutPrompt
source: Are you sure you want to logout?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

# parentNavBarFooterVersion
source: Learning App v2.0
ar: تطبيق التعلم الإصدار 2.0

# parentNavBarProfile
source: Profile
ar: حساب تعريفي

source: Improvement Suggestions
ar: اقتراحات للتحسين

source: OK
ar: حسناً

source: Previous
ar: السابقة

# storyCounter
source: Story {current} of {total}
ar: القصة {current} من {total}

source: Story
ar: القصة

# writeSummaryHere
source: Write Your Summary Here
ar: اكتب ملخصك هنا

# summaryHint
source: Write a summary of the story you read...
ar: اكتب ملخصاً للقصة التي قرأتها...

source: Checking...
ar: جاري الفحص...

source: Check Summary
ar: فحص الملخص

source: Story Summarizer Game
ar: لعبة تلخيص القصص

# letterLevel2
source: Level 2
ar: المستوي الثاني

source: Record your voice
ar: سجّل صوتك

source: Stop
ar: إيقاف

# errorTryAgain
source: An error occurred, try again
ar: حدث خطأ، حاول مرة أخرى

source: Read Aloud
ar: اقرأ بصوت عالٍ

# genderValidationError
source: Please select a gender
ar: اختار النوع

# birthdateValidation
source: Please select a birthdate
ar: يرجى اختيار تاريخ الميلاد

# usernameHint
source: Username
ar: اسم المستخدم

# tutorialCourseTitle
source: Click here to explore your courses!
ar: اضغط هنا لاستكشاف الدورات التدريبية الخاصة بك!

# tutorialCourseSubtitle
source: Tap to navigate to your course list
ar: اضغط للانتقال إلى قائمة الدورات

# tutorialSkip
source: Skip
ar: تخطي

# tutorialCourseCardTitle
source: This is your course
ar: هذه هي دورتك

# tutorialCourseCardDescription
source: Tap here to proceed.
ar: اضغط هنا للمتابعة.

# tutorialPlayButtonTitle
source: Play Button
ar: زر التشغيل

# tutorialPlayButtonDescription
source: Tap this button to start the exercise.
ar: اضغط على هذا الزر لبدء التمرين.

# tutorialExpandButtonTitle
source: Expand View
ar: عرض المزيد

# tutorialExpandButtonDescription
source: Click to see more content or details.
ar: انقر لرؤية المزيد من المحتوى أو التفاصيل.

# expandLevelsTitle
source: View Available Levels
ar: عرض المستويات المتاحة

# expandLevelsDescription
source: Tap this button to explore all available levels and games for this exercise. You need to tap it to continue!
ar: اضغط على هذا الزر لاستكشاف جميع المستويات والألعاب المتاحة لهذا التمرين. يجب الضغط للمتابعة!

# levelsSectionTitle
source: Course Levels
ar: مستويات الدورة

# levelsSectionDescription
source: These are the available levels for this course. Each level includes unique games and activities to help you learn.
ar: هذه هي المستويات المتاحة لهذه الدورة. يحتوي كل مستوى على ألعاب وأنشطة مختلفة تساعدك على التعلم.

# gamesNavigationTitle
source: Games Navigation
ar: التنقل بين الألعاب

# gamesNavigationDescription
source: Tap any game chip to go directly to that game within the course.
ar: اضغط على أي لعبة للانتقال مباشرةً إلى تلك اللعبة ضمن الدورة.

# mainCourseNavigationTitle
source: Main Course Navigation
ar: التنقل إلى الدورة الرئيسية

# mainCourseNavigationDescription
source: Tap this play button to go to the main course page. You must tap it to complete the tutorial!
ar: اضغط على زر التشغيل للانتقال إلى صفحة الدورة الرئيسية. يجب الضغط لإكمال الشرح!

source: Welcome
ar: مرحبا

# loginSubtitle
source: Welcome back! Please sign in to continue
ar: مرحبًا بعودتك! الرجاء تسجيل الدخول للمتابعة

# drawerMenuTitle
source: Navigation Menu
ar: قائمة التنقل

# drawerMenuDescription
source: Tap these Navigation Menu to open the side menu. Here you can change your language preferences and log out when needed.
ar: اضغط على قائمة التنقل لفتح القائمة الجانبية. يمكنك تغيير اللغة أو تسجيل الخروج من هنا.

# profileTabTitle
source: Your Profile
ar: ملفك الشخصي

# profileTabDescription
source: Tap here to view and update your profile information. Manage your personal details and preferences.
ar: اضغط هنا لعرض وتحديث معلومات ملفك الشخصي. قم بإدارة التفاصيل والتفضيلات الخاصة بك.

# coursesTabTitle
source: Your Courses
ar: دوراتك

# coursesTabDescription
source: Access all your courses here. Browse available lessons, track your progress, and continue your learning journey.
ar: يمكنك الوصول إلى جميع دوراتك من هنا. تصفح الدروس المتاحة وتابع تقدمك.

source: Hello
ar: مرحباً

source: Phone Number
ar: رقم الهاتف

source: Nationality
ar: الجنسية

source: Gender
ar: الجنس

source: Birthday
ar: تاريخ الميلاد

source: Age
ar: العمر

# personalInfo
source: Personal Information
ar: المعلومات الشخصية

# errorTitle
source: Oops! Something went wrong
ar: عذراً! حدث خطأ ما

# noData
source: No profile data available
ar: لا توجد بيانات متاحة

source: Email
ar: البريد الإلكتروني

# orderSentencesTitle
source: Order the sentences correctly
ar: رتب الجمل بالترتيب الصحيح

source: round
ar: الجولة

# of2
source: of
ar: من

# correctAnswer2
source: Correct Answer!
ar: إجابة صحيحة!

# wrongAnswer2
source: Wrong Answer
ar: إجابة خاطئة

source: Points
ar: النقاط

source: End Game
ar: إنهاء اللعبة

source: Next Round
ar: الجولة التالية

# performanceExcellent
source: Excellent! Outstanding performance!
ar: ممتاز! أداء رائع جداً!

# performanceVeryGood
source: Very good! Great job!
ar: جيد جداً! أداء ممتاز!

# performanceGood
source: Good! You can do even better!
ar: جيد! يمكنك تحسين أدائك!

# performanceTryAgain
source: Try again to improve your score!
ar: حاول مرة أخرى لتحسين نتيجتك!

source: Percentage
ar: النسبة المئوية

source: Back to Menu
ar: العودة للقائمة

source: Error
ar: خطأ

source: Sentence Ordering
ar: ترتيب الجمل

# playingNow
source: Playing...
ar: جاري التشغيل...

source: Reveal Sentences
ar: اكشف الجمل

source: Confirm Answer
ar: تأكيد الإجابة

# dragSentencesHint
source: Drag the sentences here to arrange them
ar: اسحب الجمل هنا لترتيبها

source: Close
ar: إغلاق

source: accuracy
ar: الدقة

# title1
source: Welcome to your special world where learning is fun
ar: مرحباً بك في عالمك الخاص حيث متعة التعلم

# desc1
source: I'm your friend (the app). Let me take you on a daily journey of progress and growth.
ar: أنا صديقك (التطبيق) دعني أخذك معي في رحلة يومية نحو التقدم و التطوير

# button1
source: Start
ar: ابدأ

# title2
source: Together, we will learn to read and write Arabic properly
ar: معاً سنتعلم كيف نقرأ ونكتب اللغة العربية بشكل سليم

# desc2
source: It will be a fun journey, step by step, until you become an expert.
ar: ستكون رحلة مليئة بالمرح لكن لا داعي للقلق سنتعلم خطوة بخطوة حتى تصبح محترفاً.

# button2
source: Continue
ar: استمرار

# title3
source: Don't fear trying, keep going until you break the fear barrier
ar: لا تخف من التجربة، حاول بلا توقف حتى تكسر حاجز الخوف

# desc3
source: Nothing can stop you.
ar: فلا شيء يستطيع إيقافك

# submitbutton
source: Done
ar: تم

# introTitle
source: How would you like to register?
ar: كَيْفَ تُوَدُّ التَّسْجِيلَ؟

# guardianTitle
source: Register for someone you care about
ar: سجل لمن تحب

# guardianDescription
source: Registering as a guardian allows you to track and follow the progress of your loved ones, whether they are your children, students, or anyone under your responsibility.
ar: تسجيلك كولي أمر يمكنك من تسجيل و متابعة تقدم أحيانك، سواء كالوا أبناءك، طلابك، أو أي شخص تحت مسئوليتك

# userTitle
source: Register for yourself
ar: سجل لنفسك

# userDescription
source: If you are older than 12, you can now easily register for yourself by clicking the user start button.
ar: إذا كان عمرك يزيد عن 12 سنة. يمكنك الآن التسجيل بنفسك بسهولة فقط اضغط على زر مستخدم البدء.

# guardianButton
source: Guardian
ar: ولي أمر

# userButton
source: User
ar: مستخدم

# loginTitle
source: Login
ar: تسجيل الدُّخول

# emailHint
source: Email
ar: البريد الالكتروني

source: Forgot Password?
ar: نسيت كلمة المرور؟

# loginButton
source: Login
ar: تسجيل الدخول

source: or continue with
ar: أو اكمل بواسطة

# noAccount
source: Don’t have an account?
ar: ليس لديك حساب؟

# createAccountUser
source: Create a user account
ar: إنشاء حساب مستخدم

# createAccountGaurdian
source: Create a gaurdian account
ar: إنشاء حساب ولي أمر

# forgotPasswordTitle
source: Forgot Password?
ar: نَسِيتَ كَلِمَةَ المَرُورِ؟

# forgotPasswordHint
source: Enter your registered phone or email
ar: أدخل رقم الهاتف أو البريد الإلكتروني المسجل

# continueButton
source: Continue
ar: استمرار

# otpPrompt
source: Please enter the verification code
ar: بِرَجَاءِإدْخَالِ رَمْزِالتَّحْقق

# changePasswordTitle
source: Change Password
ar: تَغْيِيرُ كَلِمَةِ المَرُورِ

# changepasswordHint
source: Password
ar: كلمة المرور

# confirmPasswordHint
source: Confirm Password
ar: تأكيد كلمة المرور

# errorEmptyEmail
source: Email cannot be empty
ar: لا يمكن ترك البريد الإلكتروني فارغًا

# errorEmptyPassword
source: Password cannot be empty
ar: لا يمكن ترك كلمة المرور فارغة

# successLogin
source: Login successful
ar: تم تسجيل الدخول بنجاح

# invalidCredentials
source: Invalid username or password. Please try again.
ar: اسم المستخدم أو كلمة المرور غير صحيحة. حاول مرة أخرى.

# levelLabel
source: spell the word
ar: انطق الكلمة

# greeting
source: Hello {name}
ar: مرحباً {name}

# dontWorry
source: Don’t worry, it’s okay
ar: لا تخف لا داعي للقلق

# attemptsLeft
source: {count} attempts left
ar: متبقي لك {count} محاولات

# noWordsAvailable
source: No words available at this level.
ar: لا توجد كلمات في هذا المستوى.

# recordingTimeout
source: Recording time limit reached!
ar: انتهى الوقت المسموح للتسجيل!

# recordingStartError
source: Error starting recording: {error}
ar: خطأ في بدء التسجيل: {error}

# ignoredRecording
source: Recording ignored
ar: تم تجاهل التسجيل

# processingRecording
source: Processing your recording...
ar: جاري معالجة التسجيل...

# processingError
source: An error occurred while processing
ar: حدث خطأ أثناء معالجة التسجيل

# outOfTries
source: No attempts left! Moving to the next word...
ar: انتهت المحاولات! سننتقل للكلمة التالية...

# nextButton
source: Next
ar: التالي

# transcriptLabel
source: Transcript
ar: النص المدخل

# recordingError
source: Error: {error}
ar: خطأ: {error}

source: Confirm
ar: تأكيد

# feedbackWidgetAnalyzing
source: Analyzing...
ar: جاري التحليل...

# progressCompleted
source: {percent}% completed
ar: {percent}% تم الإنجاز

# progressPoints
source: {points} pts
ar: {points} نقطة

# exerciseProgressLabel
source: Progress
ar: التقدم

# helloLabel
source: Hello,
ar: مرحباً،

# searchCoursesHint
source: Search courses...
ar: ابحث عن الدورات...

source: Continue Learning
ar: واصل التعلُّم

source: Available Exercises
ar: التمارين المتاحة

source: See All
ar: عرض الكل

source: No exercises available
ar: لا توجد تمارين متاحة

# bottomNavHome
source: Home
ar: الرئيسية

# bottomNavCourses
source: Courses
ar: الدورات
